<?php
//-----------------------------------------------------------------------------
//    Discuz! Board 1.0 Standard - Discuz! 中文论坛 (PHP & MySQL) 1.0 标准版
//-----------------------------------------------------------------------------
//    Copyright(C) Dai Zhikang, Crossday Studio, 2002. All rights reserved
//
//    Crossday 工作室 www.crossday.com    *Discuz! 技术支持 www.Discuz.net
//-----------------------------------------------------------------------------
//  请详细阅读 Discuz! 授权协议,查看或使用 Discuz! 的任何部分意味着完全同意
//  协议中的全部条款,请举手之劳支持国内软件事业,严禁一切违反协议的侵权行为.
//-----------------------------------------------------------------------------
// Discuz! 专注于提供高效强大的论坛解决方案,如用于商业用途,您必须购买使用授权!
//-----------------------------------------------------------------------------


// ==================== 以下变量需根据您的服务器说明档修改 ====================
//	注意: 	如果数据库连接有问题,请不要向我们询问具体参数设置,请与空间商联系,
//		因为我们也无法告诉你这些变量应该设置为何值

	$dbhost = "localhost";   	// 数据库服务器
	$dbuser = "root";   		// 数据库用户名
	$dbpw = "123456";   		// 数据库密码
	$dbname = "discuz";		// 数据库名
	$adminemail = "admin@domain.com";	// 论坛系统 Email

// ============================================================================



// ============= 如您对 cookie 作用范围有特殊要求,请修改下面变量 ==============

	$cookiepath = "/";		// cookie 作用路径 (如出现登录问题请修改此项)
	$cookiedomain = ""; 		// cookie 作用域 (如出现登录问题请修改此项)

// ============================================================================



// =============== Discuz! 插件,配置和使用方法详情请参考 faq.txt ==============

	// 请参考 plugin.txt 中提供的方法配置插件接口

// ============================================================================



// ================= 以下变量为特别选项,一般情况下没有必要修改 ================

	$database = "mysql";		// 不能修改此处
	$pconnect = 1;			// 数据库连接方式 0=connect, 1=pconnect
	$headercharset = 0;		// 强制设置字符集, 0=否, 1=是. 乱码时使用
	$onlinehold = 600;		// 在线保持时间(秒)


	// 论坛投入使用后不能修改的变量

	$encrypt = "md5";   		// 密码加密方式, 可选"md5", "des", "none"
	$tablepre = "cdb_";   		// 表名前缀, 同一数据库安装多个论坛请修改此处
	$charset = "utf-8";		// 除非进行了程序繁体化修改, 否则请保留默认!
					// 只能选择 gb2312 和 big5 (小写)
	$attachdir = "./attachments";	// 附件保存位置 (服务器路径, 属性 777, 必须
					// 为 web 可访问到的目录)
	$attachurl = "attachments";	// 附件路径 URL 地址 (可为当前 URL 下的相对
					// 地址或 http:// 开头的绝对地址)

    $plugins[] = array (	"name" => "批量生成数据",//插件
    "url" => "insert.php",//前台显示
    "cpurl" => "admincp.php?action=plugin"	);//后台显示

// ============================================================================